In [111]:
import pandas as pd
import numpy as np
exam1 = [89,85,93,83]
labels  = ['Student A', 'Student B', 'Student C', 'Student D']

e1 = pd.Series(exam1,labels)
e1

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [112]:
e1['Student C']

93

In [113]:
exam2 = [74,56,44,92]
e2 = pd.Series(exam2,labels)
e2

Student A    74
Student B    56
Student C    44
Student D    92
dtype: int64

In [114]:
pd.Series(exam1,labels)['Student D']

83

In [115]:
d = {s:p for s,p in zip(labels,exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [116]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [117]:
#e1+e2

In [118]:
#e1*e2

In [119]:
#e1 / 5

In [120]:
df = pd.DataFrame({"e1": exam1, "e2": exam2},index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [121]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [122]:
df['e2']

Student A    74
Student B    56
Student C    44
Student D    92
Name: e2, dtype: int64

In [123]:
type(df['e2'])

pandas.core.series.Series

In [124]:
data = np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [125]:
df = pd.DataFrame(data.transpose(),index=labels,columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [126]:
df.shape

(4, 2)

In [127]:
#kolumny ['e3'] wcześniej nie było w, zostaje ona w zapisie poniżej automatycznie utworzona
df['e3'] = [67,59,79,84]
df

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [128]:
df.loc['Student A']
#type(df.loc['Student A'])

e1    89
e2    74
e3    67
Name: Student A, dtype: int64

In [129]:
df['semestr 1'] = df['e1']+df['e2']+df['e3']
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [130]:
df.loc['Student C']

e1            93
e2            44
e3            79
semestr 1    216
Name: Student C, dtype: int64

In [131]:
df.loc['Student C','e1']

93

In [132]:
df.loc[['Student C','Student D'],['e2']]

           e2
Student C  44
Student D  92

In [133]:
df.iloc[3]

e1            83
e2            92
e3            84
semestr 1    259
Name: Student D, dtype: int64

In [134]:
#Slicing 
df.iloc[1:,1]

Student B    56
Student C    44
Student D    92
Name: e2, dtype: int32

In [135]:
#Masking na podstawie wyrażen logicznych
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [136]:
df['e2'] > 70
#type(df['e2'] > 70)

Student A     True
Student B    False
Student C    False
Student D     True
Name: e2, dtype: bool

In [137]:
df[df['e2']> 70]#Pokazuje tylko takie wiersze gdzie e2>70

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student D  83  92  84        259

In [138]:
df[ (df['e2']>60) & (df['e2']<90)] #pokaz tycz uczniow ktorzy egzamin e2 zaliczyli na wiecej niz 60 i mniej niz 90

           e1  e2  e3  semestr 1
Student A  89  74  67        230

In [139]:
# PODSTAWOWE OPERACJE

In [141]:
df.drop('semestr 1',axis=1)   #axis = 1 mówi nam, że chodzi o kolumnę, domyślną wartością jest axis=0 czyli wiersz

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [142]:
df.drop('Student A')

           e1  e2  e3  semestr 1
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [143]:
df   #Widzimy, że usunięte wcześniej kolumna semestr 1 oraz wiersz Student A ciągle są w zmiennej df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [144]:
#df.drop(['e3','semestr 1'],axis=1,inplace=True)  #podanie parametru inplace=True usunie kolumny e3 i semestr 1 na zawsze
#df

In [145]:
#df.drop('Student B',inplace=True)   #usuniecie wynikow studenta B
#df

In [62]:
#df

In [64]:
#

In [146]:
#

In [150]:
#Resetowanie i ustawianie indeksu

In [173]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [179]:
df.reset_index()

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [178]:
#

In [177]:
#

In [126]:
#resetowanie i usuwanie indeksu, sposob 1 - funkcja set_index

In [180]:
df_new_index = df.reset_index()
df_new_index

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [181]:
df_new_index['student_name'] = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index

       index  e1  e2  e3  semestr 1 student_name
0  Student A  89  74  67        230       Adrian
1  Student B  85  56  59        200   Bartłomiej
2  Student C  93  44  79        216       Celina
3  Student D  83  92  84        259      Dagmara

In [182]:
df_new_index.set_index('student_name')

                  index  e1  e2  e3  semestr 1
student_name
Adrian        Student A  89  74  67        230
Bartłomiej    Student B  85  56  59        200
Celina        Student C  93  44  79        216
Dagmara       Student D  83  92  84        259

In [131]:
#resetowanie i usuwanie indeksu, sposob 2 - zmiany bezposrednio na atrybucie index

In [183]:
df_new_index2 = df.reset_index()
df_new_index2

       index  e1  e2  e3  semestr 1
0  Student A  89  74  67        230
1  Student B  85  56  59        200
2  Student C  93  44  79        216
3  Student D  83  92  84        259

In [185]:
df_new_index2.index = ['Adrian','Bartłomiej','Celina','Dagmara']
df_new_index2

                index  e1  e2  e3  semestr 1
Adrian      Student A  89  74  67        230
Bartłomiej  Student B  85  56  59        200
Celina      Student C  93  44  79        216
Dagmara     Student D  83  92  84        259

In [186]:
#Funkcja rename – zmiana etykiet kolumn i wierszy

In [187]:
df.rename(columns={'e1':'exam1','e2':'exam2','e3':'exam3'})

           exam1  exam2  exam3  semestr 1
Student A     89     74     67        230
Student B     85     56     59        200
Student C     93     44     79        216
Student D     83     92     84        259

In [188]:
df.rename(columns={'e1':'exam1','e2':'exam2','e3':'exam3'})

           exam1  exam2  exam3  semestr 1
Student A     89     74     67        230
Student B     85     56     59        200
Student C     93     44     79        216
Student D     83     92     84        259

In [189]:
df.rename(index={'Student C':'Studencik C'})

             e1  e2  e3  semestr 1
Student A    89  74  67        230
Student B    85  56  59        200
Studencik C  93  44  79        216
Student D    83  92  84        259

In [190]:
df.rename(str.upper, axis='columns')

           E1  E2  E3  SEMESTR 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [193]:
#df.rename(str.upper, axis=0)

In [194]:
df

           e1  e2  e3  semestr 1
Student A  89  74  67        230
Student B  85  56  59        200
Student C  93  44  79        216
Student D  83  92  84        259

In [ ]:
#MULTI_INDEX